/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Недопустимое значение.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "Значение «%@» недопустимо.";

/* NSFormattingError */
"Err2048-C" = "Ошибка форматирования.";

/* NSFileLockingError */
"Err255-C" = "Не удалось защитить файл от записи.";

/* NSFileLockingError */
"Err255-R" = "Возможно, доступ к файлу уже закрыт, или у Вас нет соответствующих прав для закрытия доступа.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Не удалось защитить файл «%@» от записи.";

/* NSFileReadUnknownError */
"Err256" = "Не удалось открыть файл.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Не удалось открыть файл «%@».";

/* NSFileReadNoPermissionError */
"Err257" = "Невозможно открыть файл, поскольку у Вас нет соответствующих прав доступа.";

/* NSFileReadNoPermissionError */
"Err257-C" = "У Вас нет соответствующих прав доступа.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Для просмотра или изменения прав доступа выберите объект в Finder и пункт меню «Файл» > «Свойства».";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Невозможно открыть файл «%@», поскольку у Вас не соответствующих прав доступа.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Недопустимое имя файла.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Не удалось открыть объект, т. к. имя файла «%@» недействительно.";

/* NSFileReadCorruptFileError */
"Err259" = "Невозможно открыть файл, поскольку он имеет неправильный формат.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Файл имеет неправильный формат.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Возможно, файл поврежден, сокращен или имеет другой формат.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Не удалось открыть файл «%@», т. к. он имеет неправильный формат.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Файл не существует.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Файл «%@» не существует.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Не удалось открыть файл, используя заданную кодировку текста.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Заданная кодировка текста не применима.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Кодировка текста %@ не применима.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Файл, возможно, сохранен в другой кодировке текста, или это не текстовый файл.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Не удалось открыть файл, используя кодировку текста %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Не удалось открыть файл «%2$@», используя кодировку текста %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Невозможно открыть файл, поскольку заданный тип ссылки не поддерживается.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Заданный тип ссылки не поддерживается.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Не удалось открыть файл «%1$@», поскольку тип ссылки %2$@ не поддерживается.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Невозможно открыть файл, поскольку тип ссылки %@ не поддерживается.";

/* NSFileReadTooLargeError */
"Err263" = "Файл невозможно открыть, потому что он слишком большой.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Файл слишком большой.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Не удалось открыть файл «%@», т. к. он слишком велик.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Не удалось открыть файл, т. к. невозможно было определить тип кодировки текста для контента.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Не удалось определить кодировку текста для контента.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Файл можно открыть, точно указав тип кодировки текста.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Не удалось открыть файл «%@», т. к. невозможно было определить тип кодировки текста для контента.";

/* NSUserCancelledError */
"Err3072-C" = "Операция отменена.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Не удалось удалить «%@».";

/* NSFileNoSuchFileError */
"Err4-C" = "Файл не существует.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Файл «%@» не существует.";

/* NSFileWriteUnknownError */
"Err512" = "Не удалось сохранить файл.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Не удалось копировать «%1$@» в «%2$@».";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Не удалось соединить «%1$@» с «%2$@».";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Не удалось переместить «%1$@» в «%2$@».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Не удалось удалить «%@».";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Не удалось сохранить файл «%2$@» в папке «%1$@».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Не удалось сохранить файл «%@».";

/* NSFileWriteNoPermissionError */
"Err513" = "Невозможно сохранить файл, поскольку у Вас нет соответствующих прав доступа.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Не удалось копировать «%1$@», т. к. у Вас не соответствующих прав доступа для «%2$@».";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Не удалось создать ссылку для «%1$@», т. к. у Вас нет соответствующих прав доступа для «%2$@».";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Не удалось переместить «%1$@», т. к. у Вас нет соответствующих прав доступа для «%2$@».";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Не удалось удалить файл «%@», т. к. у Вас нет соответствующих прав доступа.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "У Вас нет соответствующих прав доступа.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Для просмотра или изменения прав доступа выберите объект в Finder и пункт меню «Файл» > «Свойства».";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "У Вас нет соответствующих прав доступа для сохранения файла %2$@ в папке %1$@.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "У Вас нет соответствующих прав доступа для сохранения файла %@.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Невозможно сохранить файл, поскольку имя файла недопустимо.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Не удалось удалить объект, т. к. имя файла «%@» недействительно.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Недопустимое имя файла.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Не удалось сохранить объект, т. к. имя файла «%@» недействительно.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Не удалось сохранить файл, используя заданную кодировку текста.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Заданная кодировка текста не применима.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Кодировка текста %@ не применима.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Если возможно, выберите другую кодировку текста.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Не удалось сохранить файл, используя кодировку текста %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Не удалось сохранить файл «%2$@», используя кодировку текста %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Невозможно сохранить файл, поскольку заданный тип ссылки не поддерживается.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Заданный тип ссылки не поддерживается.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Не удалось сохранить файл «%1$@», поскольку тип ссылки %2$@ не поддерживается.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Невозможно сохранить файл, поскольку тип ссылки %@ не поддерживается.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Невозможно было сохранить файл, поскольку недостаточно места.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Не удалось копировать «%1$@» в «%2$@», т. к. недостаточно свободного места.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Не удалось соединить «%1$@» с «%2$@», т. к. недостаточно свободного места.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Не удалось переместить «%1$@» в «%2$@», т. к. недостаточно свободного места.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Недостаточно места.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "На томе %@ нет места.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Удалите некоторые файлы с диска и попытайтесь еще раз.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Невозможно сохранить файл «%@», поскольку недостаточно места.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Невозможно сохранить файл %1$@, поскольку на диске %2$@ нет места.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "Операцию не удалось завершить. (%1$@ ошибка %2$ld.)";

